# LinkElementId Properties

---
The LinkElementId type exposes the following members.
| Name| Description
---|---|---
| HostElementId|  The id of the element in the host, or invalidElementId if there is a link.
| LinkedElementId|  The id of the element in the link, or invalidElementId if no link.
| LinkInstanceId|  The id of the link, or invalidElementId if no link.
Top
#### Reference
LinkElementId Class
Autodesk.Revit.DB Namespace